; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 4466)
	(= (fuel plane1) 125)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city7)
	(= (capacity plane2) 8152)
	(= (fuel plane2) 2034)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city7)
	(= (capacity plane3) 2608)
	(= (fuel plane3) 249)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city1)
	(= (capacity plane4) 11999)
	(= (fuel plane4) 2266)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 15)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city2)
	(= (capacity plane5) 5192)
	(= (fuel plane5) 1210)
	(= (slow-burn plane5) 2)
	(= (fast-burn plane5) 6)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city5)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city5)
	(at person6 city0)
	(at person7 city3)
	(at person8 city1)
	(at person9 city7)
	(at person10 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 909)
	(= (distance city0 city2) 753)
	(= (distance city0 city3) 544)
	(= (distance city0 city4) 892)
	(= (distance city0 city5) 670)
	(= (distance city0 city6) 905)
	(= (distance city0 city7) 959)
	(= (distance city0 city8) 638)
	(= (distance city0 city9) 597)
	(= (distance city1 city0) 909)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 930)
	(= (distance city1 city3) 675)
	(= (distance city1 city4) 723)
	(= (distance city1 city5) 510)
	(= (distance city1 city6) 518)
	(= (distance city1 city7) 564)
	(= (distance city1 city8) 674)
	(= (distance city1 city9) 862)
	(= (distance city2 city0) 753)
	(= (distance city2 city1) 930)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 764)
	(= (distance city2 city4) 843)
	(= (distance city2 city5) 963)
	(= (distance city2 city6) 922)
	(= (distance city2 city7) 559)
	(= (distance city2 city8) 528)
	(= (distance city2 city9) 642)
	(= (distance city3 city0) 544)
	(= (distance city3 city1) 675)
	(= (distance city3 city2) 764)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 812)
	(= (distance city3 city5) 803)
	(= (distance city3 city6) 660)
	(= (distance city3 city7) 875)
	(= (distance city3 city8) 811)
	(= (distance city3 city9) 984)
	(= (distance city4 city0) 892)
	(= (distance city4 city1) 723)
	(= (distance city4 city2) 843)
	(= (distance city4 city3) 812)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 529)
	(= (distance city4 city6) 721)
	(= (distance city4 city7) 737)
	(= (distance city4 city8) 573)
	(= (distance city4 city9) 614)
	(= (distance city5 city0) 670)
	(= (distance city5 city1) 510)
	(= (distance city5 city2) 963)
	(= (distance city5 city3) 803)
	(= (distance city5 city4) 529)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 908)
	(= (distance city5 city7) 979)
	(= (distance city5 city8) 573)
	(= (distance city5 city9) 546)
	(= (distance city6 city0) 905)
	(= (distance city6 city1) 518)
	(= (distance city6 city2) 922)
	(= (distance city6 city3) 660)
	(= (distance city6 city4) 721)
	(= (distance city6 city5) 908)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 576)
	(= (distance city6 city8) 503)
	(= (distance city6 city9) 722)
	(= (distance city7 city0) 959)
	(= (distance city7 city1) 564)
	(= (distance city7 city2) 559)
	(= (distance city7 city3) 875)
	(= (distance city7 city4) 737)
	(= (distance city7 city5) 979)
	(= (distance city7 city6) 576)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 799)
	(= (distance city7 city9) 514)
	(= (distance city8 city0) 638)
	(= (distance city8 city1) 674)
	(= (distance city8 city2) 528)
	(= (distance city8 city3) 811)
	(= (distance city8 city4) 573)
	(= (distance city8 city5) 573)
	(= (distance city8 city6) 503)
	(= (distance city8 city7) 799)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 740)
	(= (distance city9 city0) 597)
	(= (distance city9 city1) 862)
	(= (distance city9 city2) 642)
	(= (distance city9 city3) 984)
	(= (distance city9 city4) 614)
	(= (distance city9 city5) 546)
	(= (distance city9 city6) 722)
	(= (distance city9 city7) 514)
	(= (distance city9 city8) 740)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at plane2 city7)
	(at plane5 city7)
	(at person1 city2)
	(at person2 city7)
	(at person3 city9)
	(at person4 city3)
	(at person5 city9)
	(at person6 city9)
	(at person7 city5)
	(at person8 city9)
	(at person9 city4)
	(at person10 city8)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane1 city7)
   changed: (fuel plane1) from 125 to 4466
   goals met: 1 of 13
2. (fly plane4 city1 city7)
   deleted: (at plane4 city1)
   added: (at plane4 city7)
   changed: (total-fuel-used) from 0 to 2256, (fuel plane4) from 2266 to 10
   goals met: 1 of 13
3. (board person9 plane1 city7)
   deleted: (at person9 city7)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 13
4. (fly plane1 city7 city4)
   deleted: (at plane1 city7)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2256 to 3730, (fuel plane1) from 4466 to 2992
   goals met: 1 of 13
5. (board person10 plane1 city4)
   deleted: (at person10 city4)
   added: (in person10 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 13
6. (debark person9 plane1 city4)
   deleted: (in person9 plane1)
   added: (at person9 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 13
7. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 3730 to 4788, (fuel plane1) from 2992 to 1934
   goals met: 2 of 13
8. (fly plane5 city2 city7)
   deleted: (at plane5 city2)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 4788 to 5906, (fuel plane5) from 1210 to 92
   goals met: 3 of 13
9. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 13
10. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 13
11. (refuel plane2 city7)
   changed: (fuel plane2) from 2034 to 8152
   goals met: 3 of 13
12. (fly plane2 city7 city0)
   deleted: (at plane2 city7)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 5906 to 8783, (fuel plane2) from 8152 to 5275
   goals met: 2 of 13
13. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 13
14. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 13
15. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 13
16. (fly plane2 city0 city9)
   deleted: (at plane2 city0)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 8783 to 10574, (fuel plane2) from 5275 to 3484
   goals met: 2 of 13
17. (fly plane2 city9 city7)
   deleted: (at plane2 city9)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 10574 to 12116, (fuel plane2) from 3484 to 1942
   goals met: 3 of 13
18. (debark person2 plane2 city7)
   deleted: (in person2 plane2)
   added: (at person2 city7)
   changed: (onboard plane2) from 3 to 2
   goals met: 4 of 13
19. (fly plane2 city7 city9)
   deleted: (at plane2 city7)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 12116 to 13658, (fuel plane2) from 1942 to 400
   goals met: 3 of 13
20. (debark person3 plane2 city9)
   deleted: (in person3 plane2)
   added: (at person3 city9)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 13
21. (debark person6 plane2 city9)
   deleted: (in person6 plane2)
   added: (at person6 city9)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 13
22. (refuel plane2 city9)
   changed: (fuel plane2) from 400 to 8152
   goals met: 5 of 13
23. (zoom plane2 city9 city3)
   deleted: (at plane2 city9)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 13658 to 19562, (fuel plane2) from 8152 to 2248
   goals met: 5 of 13
24. (refuel plane2 city3)
   changed: (fuel plane2) from 2248 to 8152
   goals met: 5 of 13
25. (board person7 plane2 city3)
   deleted: (at person7 city3)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 13
26. (zoom plane2 city3 city5)
   deleted: (at plane2 city3)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 19562 to 24380, (fuel plane2) from 8152 to 3334
   goals met: 5 of 13
27. (debark person7 plane2 city5)
   deleted: (in person7 plane2)
   added: (at person7 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 13
28. (fly plane2 city5 city7)
   deleted: (at plane2 city5)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 24380 to 27317, (fuel plane2) from 3334 to 397
   goals met: 7 of 13
29. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 27317 to 29243, (fuel plane1) from 1934 to 8
   goals met: 7 of 13
30. (refuel plane1 city2)
   changed: (fuel plane1) from 8 to 4466
   goals met: 7 of 13
31. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 13
32. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 8 of 13
33. (fly plane1 city2 city9)
   deleted: (at plane1 city2)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 29243 to 30527, (fuel plane1) from 4466 to 3182
   goals met: 8 of 13
34. (debark person5 plane1 city9)
   deleted: (in person5 plane1)
   added: (at person5 city9)
   changed: (onboard plane1) from 3 to 2
   goals met: 9 of 13
35. (fly plane1 city9 city8)
   deleted: (at plane1 city9)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 30527 to 32007, (fuel plane1) from 3182 to 1702
   goals met: 9 of 13
36. (debark person10 plane1 city8)
   deleted: (in person10 plane1)
   added: (at person10 city8)
   changed: (onboard plane1) from 2 to 1
   goals met: 10 of 13
37. (fly plane1 city8 city3)
   deleted: (at plane1 city8)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 32007 to 33629, (fuel plane1) from 1702 to 80
   goals met: 11 of 13
38. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 12 of 13
39. (refuel plane4 city7)
   changed: (fuel plane4) from 10 to 11999
   goals met: 12 of 13
40. (fly plane4 city7 city1)
   deleted: (at plane4 city7)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 33629 to 35885, (fuel plane4) from 11999 to 9743
   goals met: 12 of 13
41. (board person8 plane4 city1)
   deleted: (at person8 city1)
   added: (in person8 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 12 of 13
42. (fly plane4 city1 city9)
   deleted: (at plane4 city1)
   added: (at plane4 city9)
   changed: (total-fuel-used) from 35885 to 39333, (fuel plane4) from 9743 to 6295
   goals met: 12 of 13
43. (debark person8 plane4 city9)
   deleted: (in person8 plane4)
   added: (at person8 city9)
   changed: (onboard plane4) from 1 to 0
   goals met: 13 of 13
